app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `feature_image`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["title", "Feature Image test"], ["text", "Lorem Ipsum"], ["feature_image", "x-wing.jpeg"], ["created_at", "2015-10-31 20:47:57"], ["updated_at", "2015-10-31 20:47:57"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save