app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", 1]]
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["commenter", ""], ["body", ""], ["article_id", 1], ["created_at", "2015-09-26 20:56:16"], ["updated_at", "2015-09-26 20:56:16"]]

  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", 7]]
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = ? AND `comments`.`id` = ? LIMIT 1  [["article_id", 7], ["id", 6]]
DELETE FROM `comments` WHERE `comments`.`id` = ?  [["id", 6]]