app/controllers/novels_controller.rb

  def index
    @novels = Novel.all
---
SELECT `novels`.* FROM `novels`

  def create
    @story = Story.find(params[:story_id])
    @novel = @story.novels.create(novel_params)
---
SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", 1]]
INSERT INTO `novels` (`title`, `description`, `story_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["title", "Some novel name"], ["description", "This is me desc"], ["story_id", 1], ["created_at", "2015-11-27 10:49:35"], ["updated_at", "2015-11-27 10:49:35"]]