app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT `stories`.* FROM `stories`

    def set_story
      @story = Story.find(params[:id])
---
SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", 1]]