app/controllers/stories_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find_by(id: params[:user_id])
    @story = Story.find_by(id: params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
---
  def new
    @user = User.find_by(id: params[:user_id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.find_by(id: params[:user_id])
    @story = Story.find_by(id: params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
INSERT INTO `stories` (`title`, `description`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["title", "test"], ["description", ""], ["created_at", "2015-11-18 09:21:53"], ["updated_at", "2015-11-18 09:21:53"]]
---
  def create
    @user = User.find_by(id: params[:user_id])
    @story = @user.stories.build(story_params)

    respond_to do |format|
      if @story.save

SELECT  `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", 4]]
UPDATE `stories` SET `feature_image` = ?, `updated_at` = ? WHERE `stories`.`id` = ?  [["feature_image", "x-wing.jpeg"], ["updated_at", "2015-11-27 00:00:45"], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:user_id])
    @story = Story.find_by(id: params[:id])

    respond_to do |format|
      if @story.update(story_params)

DELETE FROM `stories` WHERE `stories`.`id` = ?  [["id", 1]]
---
  def destroy
    @story.destroy