app/controllers/tags_controller.rb

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = ? LIMIT 1  [["id", 1]]
---
  def show
    @tag =  ActsAsTaggableOn::Tag.find(params[:id])